Jwood1126-coder/Project-Grasshopper/firmware/sdkconfig.defaults
# Grasshopper — ESP-IDF defaults. menuconfig changes go here so they
# survive a clean build.

# Target
CONFIG_IDF_TARGET="esp32s3"
CONFIG_IDF_TARGET_ESP32S3=y

# Flash & PSRAM (ESP32-S3 WROOM N8R8 / GOOUUU clone — 8 MB flash, 8 MB OPI PSRAM)
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# Partition table (see partitions.csv)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# Console: UART0 → CH340 bridge → /dev/ttyUSB0 on the host. Same as Fox,
# because the GOOUUU board's native USB-C port is silent on these clones
# (Espressif 303a:1001 enumerates but emits no characters). Phase 3+ may
# revisit if a clean ESP-IDF native CDC works on a fresh board.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y

# Main task: needs room for setup + JSON serializers
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Arduino-as-component (used only for the Lepton SPI HAL — see
# components/hal_lepton). We provide our own app_main, so don't auto-
# start Arduino's setup() / loop().
CONFIG_AUTOSTART_ARDUINO=n
CONFIG_FREERTOS_HZ=1000

# Wi-Fi: stock defaults for phase 2; revisit when heap budget gets tight.
# (Manual override — STATIC=4 — broke the IDF v5.3 build because the
# default RX_BA_WIN of 6 must be ≤ 2 × static buffers.)

# LWIP TCP/IP task affinity → core 0. By default it has no affinity and
# runs at priority 18 — far above the VoSPI reader's priority 10. With
# no affinity, every TCP packet (relay tick, preview frame, HTTP
# response) can land on core 1 and preempt the reader for ms at a
# time, producing line mismatches and frame aborts. Pin to core 0
# alongside WiFi + esp_timer so core 1 is truly reserved for vospi.
CONFIG_LWIP_TCPIP_TASK_AFFINITY_CPU0=y

# TLS: use the bundled cert chain so wss:// works without provisioning
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_INFO=y

# Bootloader / image
CONFIG_BOOTLOADER_LOG_LEVEL_INFO=y
CONFIG_COMPILER_OPTIMIZATION_DEFAULT=y

# FATFS — enable Long File Names (LFN_STACK variant). Without LFN, FATFS
# rejects any filename >8.3 with errno=22 EINVAL, breaking session_<id>/
# directory and human-readable capture filenames. STACK variant uses
# ~4 KB of caller-task stack but doesn't allocate from heap (LFN_HEAP
# was tried — both crashed identically due to a separate WiFi-config
# issue, but STACK is the right default for our usage pattern).
# CONFIG_FATFS_LFN_NONE is not set
CONFIG_FATFS_LFN_STACK=y
CONFIG_FATFS_MAX_LFN=255

# Wi-Fi STA — committed here so 'rm sdkconfig' (used to apply Kconfig
# changes) doesn't silently lose them and brick the relay boot path.
# Phase 4 will move this to NVS via captive portal.
CONFIG_GRASSHOPPER_WIFI_SSID="iPhone 256"
CONFIG_GRASSHOPPER_WIFI_PASS="oscar123"
